In [729]:
# import Dependencies
import pandas as pd
import numpy as np

In [730]:
# Create path with a variable 
heroes_path = "../Resources/purchase_data.csv"

In [748]:
# Read in the csv from the path
heroes_df = pd.read_csv(heroes_path)
heroes_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [732]:
# Check to see if there is any missing data that needs to be removed
heroes_df.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [733]:
# look up sn's unique value
heroes_df["SN"].describe()

count           780
unique          576
top       Lisosia93
freq              5
Name: SN, dtype: object

In [765]:
# Create a new dataframe that is grouped by SN to remove any duplicate data for number of players
sn_grouped_df = heroes_df.groupby(["SN"])
print(sn_grouped_df)
sn_grouped_df.count()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000281EF332CD0>

               Purchase ID  Age  Gender  Item ID  Item Name  Price
SN
Adairialis76             1    1       1        1          1      1
Adastirin33              1    1       1        1          1      1
Aeda94                   1    1       1        1          1      1
Aela59                   1    1       1        1          1      1
Aelaria33                1    1       1        1          1      1
...                    ...  ...     ...      ...        ...    ...
Yathecal82               3    3       3        3          3      3
Yathedeu43               2    2       2        2          2      2
Yoishirrala98            1    1       1        1          1      1
Zhisrisu83               2    2       2        2          2      2
Zontibe81                3    3       3        3          3      3

[576 rows x 6 columns]

In [735]:
# Get total player amount with len() on SN
total_players = len(sn_grouped_df["SN"])
total_players

576

## Player Count
    - Dislpay the total number of players

In [736]:
# Create dataframe for total players with sn_count variable as to value
total_players_df = pd.DataFrame({"Total Players": [total_players]})
total_players_df

   Total Players
0            576

In [737]:
# Get unique items count with len() and unique() fucntion
unique_items_count = len(heroes_df["Item ID"].unique())
unique_items_count

179

In [738]:
# Get average from Price column using the mean() function
average = heroes_df["Price"].mean()
average

3.0509871794871795

In [739]:
# Get total number of purchases with len() function 
total_purchases = len(heroes_df)
total_purchases

780

In [740]:
# Get total revenue from Price column using sum() function
total_revenue = heroes_df["Price"].sum()
total_revenue

2379.77

 Purchasing Analysis (Total)
 
    - Run basic calculations to obtain number of unique items, average price, etc.


    - Create a summary data frame to hold the results


    - Optional: give the displayed data cleaner formatting


    - Display the summary data frame

In [741]:
# Create dataframe using a dictionary with keys (header) and values collected above
purchasing_analysis_df = pd.DataFrame({"Number of Unique Items": [unique_items_count], "Average Price": [average], 
                                       "Number of Purchases": [total_purchases], "Total Revenue": [total_revenue] })
purchasing_analysis_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [742]:
# .groupby gender and assure to use SN.nunique() so that it only counts user once 
# then calcuate values that will be used to create gender_table dataframe (nunique is used to convert a string into a # value)
group_by_gender = heroes_df.groupby("Gender")
gender_count = group_by_gender["SN"].nunique()
gender_percentage = (gender_count / total_players) * 100

gender_table_df = pd.DataFrame({"Total Count": gender_count, "Percentage of Players": gender_percentage})
gender_table_df

                       Total Count  Percentage of Players
Gender
Female                          81              14.062500
Male                           484              84.027778
Other / Non-Disclosed           11               1.909722

In [745]:
# .groupby gender and SN.nunique so that it only counts user once. 
# then calculate value that will be used to create dataframe (nunique is used to convert a string into a # value)
#group_by_gender = heroes_df.groupby("Gender")
#gender_count = group_by_gender["SN"].nunique()
gender_purchase_count = group_by_gender["Price"].count()
total_value_per_gender = group_by_gender["Price"].sum()
average_gender_purchase_price = (total_value_per_gender / gender_purchase_count)

In [746]:
# Create gender_demographics dataframe with values created above. 
gender_demographics_df = pd.DataFrame({"Purchase Count": gender_purchase_count, "Average Purchase Price": average_gender_purchase_price, 
                                      "Total Purchase Value": total_value_per_gender, 
                                       "Avg Total Purchase per Person": average_per_person})
gender_demographics_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [798]:
sn_grouped_df.count()

               Purchase ID  Age  Gender  Item ID  Item Name  Price
SN
Adairialis76             1    1       1        1          1      1
Adastirin33              1    1       1        1          1      1
Aeda94                   1    1       1        1          1      1
Aela59                   1    1       1        1          1      1
Aelaria33                1    1       1        1          1      1
...                    ...  ...     ...      ...        ...    ...
Yathecal82               3    3       3        3          3      3
Yathedeu43               2    2       2        2          2      2
Yoishirrala98            1    1       1        1          1      1
Zhisrisu83               2    2       2        2          2      2
Zontibe81                3    3       3        3          3      3

[576 rows x 6 columns]

In [799]:
sn_purchase_count = sn_grouped_df["Purchase ID"].count()

In [800]:
sn_price = sn_grouped_df["Price"].count()

In [801]:
sn_average_purchase_price = (sn_total_purchase_value / sn_purchase_count)

In [803]:
sn_total_purchase_value = sn_grouped_df["Price"].sum()

In [804]:
sn_table_df = pd.DataFrame({"Purchase Count": sn_purchase_count, "Average Purchase Price": sn_average_purchase_price,
                         "Total Purchase Value": sn_total_purchase_value})
sn_table_df

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [806]:
top_spenders_df = sn_table_df.sort_values("Purchase Count", ascending=False)
top_spenders_df

              Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                  5                3.792000                 18.96
Iral74                     4                3.405000                 13.62
Idastidru52                4                3.862500                 15.45
Asur53                     3                2.480000                  7.44
Inguron55                  3                3.703333                 11.11
...                      ...                     ...                   ...
Hala31                     1                1.020000                  1.02
Haisurra41                 1                4.400000                  4.40
Hailaphos89                1                3.810000                  3.81
Haestyphos66               1                1.970000                  1.97
Iskosian40                 1                3.070000                  3.07

[576 rows x 3 columns]

In [814]:
grouped_items_df = heroes_df.groupby(["Item ID", "Item Name"])

In [815]:
item_purchase_count = grouped_items_df["Purchase ID"].count()

In [816]:
item_price = grouped_items_df["Price"]

In [821]:
item_total_purchase_value = grouped_items_df item_price * item_purchase_count

TypeError: 'DataFrameGroupBy' object is not callable

In [650]:
heroes_df["Age"].max()

45

In [651]:
# Establish bins for ages
age_bin = [0, 10, 15, 20, 25, 30 ,35, 40, 45]
bin_name = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [653]:
heroes_age_group = heroes_df.groupby("Age")

age_count = heroes_age_group["SN"].value_counts()


percentage_of_players_age = (age_count / total_players) * 100

age_demographics_df = pd.DataFrame({"Total Count": age_count, "Percentage of Players": percentage_of_players_age})
age_demographics_df

                   Total Count  Percentage of Players
Age SN
7   Haillyrgue51             3               0.520833
    Chanossast57             1               0.173611
    Eusri44                  1               0.173611
    Frichossala54            1               0.173611
    Quilassa66               1               0.173611
...                        ...                    ...
42  Frichaya88               1               0.173611
43  Aeral68                  1               0.173611
44  Chanosiaya39             1               0.173611
    Isursuir31               1               0.173611
45  Assim27                  1               0.173611

[576 rows x 2 columns]

In [655]:
heroes_age_group["Age Range"] = pd.cut(heroes_age_group["Age"], age_bin, labels=bin_name, include_lowest=True )

heroes_age_group

ValueError: setting an array element with a sequence.

In [579]:
#age_demographics = pd.DataFrame(grouped_age)

In [581]:
#

NameError: name 'set_index' is not defined

In [501]:

players = heroes_df["SN"].nunique()
percentage_of_players_age = (age_count / total_players )
age_demo = pd.DataFrame({"Total Count": players, "Percentage of Players": percentage_of_players_age})
age_demo.head()

TypeError: 'RangeIndex' object is not callable

In [494]:
players = heroes_df["SN"].nunique()
percentage_of_players_age = (age_count / total_players )

In [495]:
age_demo = pd.DataFrame({"Age Range":"Total Count": players, "Percentage of Players": percentage_of_players_age})
age_demo.head()

ValueError: If using all scalar values, you must pass an index

In [456]:



heroes_age_group.set_index("Age Range")

AttributeError: 'DataFrameGroupBy' object has no attribute 'set_index'

             Total Count  Percentage of Players
Lisosia93              5                    1.0
Idastidru52            4                    1.0
Iral74                 4                    1.0
Silaera56              3                    1.0
Aina42                 3                    1.0

In [ ]:
#"Age Range": heroes_age_group,